In [21]:
import pandas as pd

# Load dataset
df = pd.read_csv(r"titanic_dataset/test.csv")

In [22]:
# Preview data
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [23]:
print("Shape = ",df.shape)
df.info()

Shape =  (418, 11)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [24]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [25]:
# Data Cleaning

#droping unrelavent columns

df.drop(columns=["PassengerId", "Cabin", "Ticket"], inplace=True)

In [26]:
print("Shape = ",df.shape)
df.info()

Shape =  (418, 8)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Fare      417 non-null    float64
 7   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 26.3+ KB

In [17]:
#calculating mean for Age
df["Age"].median()

27.0

In [27]:
# replacing missing values of Age by its median (avg can be affected by outliers)
df["Age"] = df["Age"].fillna(df["Age"].median())

In [30]:
#handling fare missing values , by filling meadian value of that class

# Finding the Pclass of the missing Fare
pclass_of_missing = df[df["Fare"].isnull()]["Pclass"].values[0]
print(pclass_of_missing)

3

In [32]:
# Get mean fare for that Pclass
median_fare = df[df["Pclass"] == pclass_of_missing]["Fare"].median()
print(median_fare)

7.8958

In [33]:
# Fill the missing fare
df["Fare"] = df["Fare"].fillna(mean_fare)

In [34]:
print("Shape = ",df.shape)
df.info()

Shape =  (418, 8)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       418 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Fare      418 non-null    float64
 7   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 26.3+ KB

In [ ]:
#Encoding Categorical Features (Sex and Embarked)

In [35]:
df["Sex"].value_counts()

Sex
male      266
female    152
Name: count, dtype: int64

In [36]:
#using map for encoding Sex column which have Binary values(male and female)
df["Sex"] = df["Sex"].map({"male": 0, "female": 1})

In [37]:
print(df.Sex)

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Sex, Length: 418, dtype: int64

In [38]:
#To encode Embarked which has three value , I am using OHE(one hot encding)

#Create 2 columns: Embarked_Q, Embarked_S
#Drop Embarked_C (to avoid redundancy)

df = pd.get_dummies(df, columns=["Embarked"], drop_first=True)

In [39]:
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S
0,3,"Kelly, Mr. James",0,34.5,0,0,7.8292,True,False
1,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,7.0000,False,True
2,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,9.6875,True,False
3,3,"Wirz, Mr. Albert",0,27.0,0,0,8.6625,False,True
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,12.2875,False,True

In [ ]:
df.to_csv("titanic_dataset/cleaned_test.csv", index=False)